wingMotion2D_pimpleFoam_v3/0.orig/cellDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      cellDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wing_main
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    flap
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    // Sostituisci 'front' e 'back' con i nomi corretti se diversi
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    // Per tutte le altre patch (inlet, outlet, walls esterni)
    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
